src/Documents/ПосещениеЗанятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПосещениеЗанятий</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиЗанятий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тренер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тренеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАбонемента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАбонементов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиЗанятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЗанятий</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЗанятий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАбонемента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАбонементов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ПосещениеЗанятий/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим) 
Запрос = Новый Запрос;

Запрос.Текст =
"ВЫБРАТЬ
|	ОстаткиЗанятийОстатки.КоличествоЗанятийОстаток КАК ОстатокЗанятий
|ИЗ
|	РегистрНакопления.ОстаткиЗанятий.Остатки(, Клиент = &Клиент	И ВидАбонемента = &ВидАбонемента)
|	КАК ОстаткиЗанятийОстатки";

Запрос.УстановитьПараметр("Клиент", Клиент);
Запрос.УстановитьПараметр("ВидАбонемента", ВидАбонемента);

РезультатЗапроса = Запрос.Выполнить();

ОстатокЗанятий = 0;  

Если РезультатЗапроса.Пустой() = Ложь Тогда
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ОстатокЗанятий = Выборка.ОстатокЗанятий;
КонецЕсли;

Если ОстатокЗанятий <= 0 Тогда
	Отказ = Истина;
	Сообщить("У клиента не осталось занятий по этому абонементу. Документ не проведён.");
	Возврат;
КонецЕсли;	     

	Движения.ОстаткиЗанятий.Записывать = Истина;
	Движение = Движения.ОстаткиЗанятий.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.ВидАбонемента = ВидАбонемента;
	Движение.КоличествоЗанятий = 1;

КонецПроцедуры
